In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('world_happiness_report_2021.csv')
data

,Country name,Regional indicator,Ladder score,Standard error of ladder score,upperwhisker,lowerwhisker,Logged GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption,Ladder score in Dystopia,Explained by: Log GDP per capita,Explained by: Social support,Explained by: Healthy life expectancy,Explained by: Freedom to make life choices,Explained by: Generosity,Explained by: Perceptions of corruption,Dystopia + residual
0,Finland,Western Europe,7.842,0.032,7.904,7.780,10.775,0.954,72.000,0.949,-0.098,0.186,2.43,1.446,1.106,0.741,0.691,0.124,0.481,3.253
1,Denmark,Western Europe,7.620,0.035,7.687,7.552,10.933,0.954,72.700,0.946,0.030,0.179,2.43,1.502,1.108,0.763,0.686,0.208,0.485,2.868
2,Switzerland,Western Europe,7.571,0.036,7.643,7.500,11.117,0.942,74.400,0.919,0.025,0.292,2.43,1.566,1.079,0.816,0.653,0.204,0.413,2.839
3,Iceland,Western Europe,7.554,0.059,7.670,7.438,10.878,0.983,73.000,0.955,0.160,0.673,2.43,1.482,1.172,0.772,0.698,0.293,0.170,2.967
4,Netherlands,Western Europe,7.464,0.027,7.518,7.410,10.932,0.942,72.400,0.913,0.175,0.338,2.43,1.501,1.079,0.753,0.647,0.302,0.384,2.798
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
144,Lesotho,Sub-Saharan Africa,3.512,0.120,3.748,3.276,7.926,0.787,48.700,0.715,-0.131,0.915,2.43,0.451,0.731,0.007,0.405,0.103,0.015,1.800
145,Botswana,Sub-Saharan Africa,3.467,0.074,3.611,3.322,9.782,0.784,59.269,0.824,-0.246,0.801,2.43,1.099,0.724,0.340,0.539,0.027,0.088,0.648
146,Rwanda,Sub-Saharan Africa,3.415,0.068,3.548,3.282,7.676,0.552,61.400,0.897,0.061,0.167,2.43,0.364,0.202,0.407,0.627,0.227,0.493,1.095
147,Zimbabwe,Sub-Saharan Africa,3.145,0.058,3.259,3.030,7.943,0.750,56.201,0.677,-0.047,0.821,2.43,0.457,0.649,0.243,0.359,0.157,0.075,1.205
148,Afghanistan,South Asia,2.523,0.038,2.596,2.449,7.695,0.463,52.493,0.382,-0.102,0.924,2.43,0.370,0.000,0.126,0.000,0.122,0.010,1.895

In [3]:
#DataFrame은 표형태(2차원)의 데이터, 인덱스와 컬럼을 가짐 , Series는 1차원 데이터
data = pd.DataFrame([['홍길동',99,'1999/1/1'], ['장길산',85,'1987/3/1'],['둘리',51,'2005/5/5']],
                   columns=['이름','성적','생일'])
data

    이름  성적        생일
0  홍길동  99  1999/1/1
1  장길산  85  1987/3/1
2   둘리  51  2005/5/5

In [4]:
data.columns

Index(['이름', '성적', '생일'], dtype='object')

In [5]:
data.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   성적      3 non-null      int64
 2   생일      3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [7]:
data.describe()

              성적
count   3.000000
mean   78.333333
std    24.684678
min    51.000000
25%    68.000000
50%    85.000000
75%    92.000000
max    99.000000

In [8]:
data = pd.DataFrame({'이름': ['홍길동','장길산','둘리'],
                     '성적': [99,85,51],
                     '생일': ['1999/1/1','1987/3/1','2005/5/5']})
data

    이름  성적        생일
0  홍길동  99  1999/1/1
1  장길산  85  1987/3/1
2   둘리  51  2005/5/5

In [9]:
data.columns = ['name','score','date']
data.index = ['first','second','third']
data

       name  score      date
first   홍길동     99  1999/1/1
second  장길산     85  1987/3/1
third    둘리     51  2005/5/5

In [10]:
data.index = range(3)
data

  name  score      date
0  홍길동     99  1999/1/1
1  장길산     85  1987/3/1
2   둘리     51  2005/5/5

In [11]:
data['name']

0    홍길동
1    장길산
2     둘리
Name: name, dtype: object

In [12]:
data.name

0    홍길동
1    장길산
2     둘리
Name: name, dtype: object

In [13]:
data[['name','score']]

  name  score
0  홍길동     99
1  장길산     85
2   둘리     51

In [14]:
data['loc'] = ['서울','원주','강릉']
data

  name  score      date loc
0  홍길동     99  1999/1/1  서울
1  장길산     85  1987/3/1  원주
2   둘리     51  2005/5/5  강릉

In [15]:
data.date = [19990101,19870301,20050505]
data

  name  score      date loc
0  홍길동     99  19990101  서울
1  장길산     85  19870301  원주
2   둘리     51  20050505  강릉

In [16]:
data.shape

(3, 4)

In [17]:
len(data)

3

In [18]:
len(data.columns)

4

In [19]:
data[:2]

  name  score      date loc
0  홍길동     99  19990101  서울
1  장길산     85  19870301  원주

In [20]:
data[[True,False,True]]

  name  score      date loc
0  홍길동     99  19990101  서울
2   둘리     51  20050505  강릉

In [21]:
data[[0,2]] #0과 2라는 컬럼명을 뽑는다는 의미이므로 에러임

KeyError: "None of [Int64Index([0, 2], dtype='int64')] are in the [columns]"

In [22]:
data.iloc[0,0]

'홍길동'

In [23]:
data.iloc[-1,-1]

'강릉'

In [24]:
data.iloc[0]

name          홍길동
score          99
date     19990101
loc            서울
Name: 0, dtype: object

In [25]:
data.iloc[:,0]

0    홍길동
1    장길산
2     둘리
Name: name, dtype: object

In [26]:
data.iloc[[0.-1]]

  name  score      date loc
2   둘리     51  20050505  강릉

In [27]:
data.iloc[::2]

  name  score      date loc
0  홍길동     99  19990101  서울
2   둘리     51  20050505  강릉

In [28]:
data.iloc[:, ::-1]

  loc      date  score name
0  서울  19990101     99  홍길동
1  원주  19870301     85  장길산
2  강릉  20050505     51   둘리